Revit 2027 API
ConduitSizeSettingIterator Methods
The ConduitSizeSettingIterator type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasCurrent |  Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the enumerator to the next item.
Reset |  Resets the iterator to the initial state.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ConduitSizeSettingIterator Class
Autodesk.Revit.DB.Electrical Namespace